<h1>About the database</h1>
The movies database has 5 tables, each one described belllow:
Recording that each id is unique in a table and is used to represent a register in a table and for this reason all the tables have an id column.
<h3>tb_movie</h3>
movie_id: it is the id of the movie<br>
movie_title: movie's title<br>
movie_date: released movie's date<br>
movie_format: can be Film or Digital<br>
movie_genre_id: this is a foreign key to the table tb_genre, it means that to this column must have one (and just one) of the ids of the tb_genre. And an id of tb_genre cab be associated to many movies (relation 1:N)<br>

<h3>tb_genre</h3>
genre_id: it is the id of the table and used as foreign key to tb_movie<br> genre_name: is the name of the genre

<h3>tb_role</h3>
role_id: it is the id of the table and used as foreign key to <br>
role_name: name of the role, like actor, director etc. <br>
created_by_user: default OS_SGAD<br>

<h3>tb_person</h3>
From now on it will be explained just the fields that represent a relation between the tables, it means, the foreign keys.<br>
person_parent_id: is a foreign key to the same table (tb_person) meaning the father of the person. In this database, a person can have one or none father. And a person can be father of many people.

<h3>tb_movie_person</h3>
This table indicates if a person, worked in a specific movie and in a specific role, was indicated to an award. So, this table will have 3 columns with a foreign key to the three tables related (tb_person, tb_movie, tb_role).<br>
movie_id: it is an id of tb_movie.<br>
person_id: it is an id of the tb_person. <br>
role_id: it is an id of the tb_role. <br>
In this table, the primary key is the set of these 3 values.

In [27]:
import mysql.connector

#connecting to the database
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="12345678",
  database="movies"
)
print(mydb)
mycursor = mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x10e68b350>

In [ ]:
# Ex 2: Has d'obtenir el nom, el país i la data de naixement d'aquelles persones per les quals no consti una data
# de mort i ordenar les dades de la persona més vella a la persona més jove.
mycursor.execute("select person_name , person_country , person_dob  from tb_person tp where person_dod IS NULL order by person_dob;")
myresult = mycursor.fetchall()
myresult

In [23]:
# Ex 3: Has d'obtenir el nom del gènere i el nombre total de pel·lícules d'aquest gènere i 
# ordenar-ho per ordre descendent de nombre total de pel·lícules.
mycursor.execute("SELECT  tg.genre_name , COUNT(*) AS total_movies \
                    FROM tb_movie tm \
                    JOIN tb_genre tg ON tm.movie_genre_id = tg.genre_id \
                    GROUP BY tm.movie_genre_id  \
                    ORDER BY total_movies DESC")
myresult = mycursor.fetchall()
myresult

[('Comedia', 3),
 ('Acción', 2),
 ('Ciencia Ficción', 2),
 ('Drama', 2),
 ('Romance', 2),
 ('Suspense', 2),
 ('Fantasía', 1),
 ('Terror', 1),
 ('Bélico', 1)]

In [28]:
# Ex 4: You need to get, for each person, their name and the maximum number of different roles they have had in the same movie.
# Subsequently, it only shows those people who have assumed more than one role in the same film.
# Starting from this query bellow it's easier to understand the final query
mycursor.execute("SELECT tm.movie_title, tp.person_name, tr.role_name \
                    FROM tb_movie_person tmp \
                    JOIN tb_person tp ON tmp.person_id = tp.person_id \
                    JOIN tb_role tr  ON tmp.role_id = tr.role_id \
                    JOIN tb_movie tm ON tmp.movie_id = tm.movie_id \
                    ORDER BY tm.movie_title, tp.person_name")
mycursor.execute("SELECT tp.person_name, count(DISTINCT tr.role_name) \
                    FROM tb_movie_person tmp \
                    JOIN tb_person tp ON tmp.person_id = tp.person_id \
                    JOIN tb_role tr  ON tmp.role_id = tr.role_id \
                    JOIN tb_movie tm ON tmp.movie_id = tm.movie_id \
                    GROUP BY tp.person_name \
                    HAVING COUNT(DISTINCT tr.role_name) > 1")
myresult = mycursor.fetchall()
myresult

[('Alfred Joseph Hitchcock', 3),
 ('Daniel Sanchez Arevalo', 2),
 ('Francis Ford Coppola', 3),
 ('George Lucas', 3),
 ('Mel Gibson', 2),
 ('Steven Spielberg', 2)]

<h1> Here are the sqls </h1>

<h3> Ex 2: </h3>
select person_name , person_country , person_dob  from tb_person tp where person_dod IS NULL order by person_dob; <br>
<h3> Ex 3: </h3>
SELECT  tg.genre_name , COUNT(*) AS total_movies <br>
FROM tb_movie tm <br>
JOIN tb_genre tg ON tm.movie_genre_id = tg.genre_id <br>
GROUP BY tm.movie_genre_id  <br>
ORDER BY total_movies DESC <br>
<h3> Ex 4: </h3>
SELECT tp.person_name, count(DISTINCT tr.role_name)
FROM tb_movie_person tmp 
JOIN tb_person tp ON tmp.person_id = tp.person_id 
JOIN tb_role tr  ON tmp.role_id = tr.role_id 
JOIN tb_movie tm ON tmp.movie_id = tm.movie_id 
GROUP BY tp.person_name
HAVING COUNT(DISTINCT tr.role_name) > 1